# BREW PACKAGES
# =============================================================================

# shell
brew "zsh"                     # brew managed zsh
brew "zsh-completions"         # extra completions
brew "zsh-autosuggestions"     # auto suggestions
brew "zsh-syntax-highlighting" # syntax highlighting
brew "pure"                    # pure shell prompt

# general
brew "git"    # global git
brew "python" # global python
brew "pyenv"  # python version manager
brew "go"     # global go
brew "gh"     # github cli
brew "exa"    # ls replacement
brew "bat"    # cat replacement
brew "mas"    # mac app store cli
brew "btop"   # resource monitor
brew "tmux"   # terminal multiplexer
brew "tpm"    # tmux plugin manager

# editor
brew "neovim"  # vim editor
brew "lazygit" # git ui
brew "ripgrep" # grep replacement
brew "fd"      # find replacement
brew "wget"    # internet file retriever

# docker
brew "colima"         # container runtimes
brew "docker"         # containerization
brew "docker-compose" # container orchestration

# BREW CASKS
# =============================================================================

# general
cask "powershell"         # powershell
cask "iterm2"             # terminal
cask "raycast"            # spotlight replacement
cask "visual-studio-code" # code editor
cask "zed"                # text editor
cask "mactex-no-gui"      # latex
cask "telegram"           # messaging
# cask "anytype"            # note-taking app

# utilities
cask "iina"           # video player
cask "openinterminal" # open terminal in current directory
cask "sf-symbols"     # system font symbols
cask "the-unarchiver" # unzip files
cask "mouse-fix"      # mouse utility
cask "monitorcontrol" # exteral monitor utility

# MAC APP STORE
# =============================================================================

# apple
mas "Keynote", id: 409183694      # presentation software
mas "Numbers", id: 409203825      # spreadsheet software
mas "Pages", id: 409201541        # word processor software
mas "Playgrounds", id: 1496833156 # swift playgrounds
mas "Xcode", id: 497799835        # xcode

# productivity
mas "Craft", id: 1487937127      # note-taking app
mas "Copilot", id: 1447330651    # finances app
mas "TechniCalc", id: 1504965415 # scientifc calculator

# utilities
mas "Tailscale", id: 1475387142 # vpn
mas "Magnet", id: 441258766     # window manager
mas "Noir", id: 1592917505      # safari dark mode
mas "Wipr", id: 1320666476      # safari ad-blocker
mas "Peek", id: 1554235898      # quicklook plugin
# mas "iPreview", id: 1519213509  # zip quicklook plugin

# FONTS
# =============================================================================

cask "font-computer-modern"          # latex
cask "font-jetbrains-mono-nerd-font" # code

# PYTHON PACKAGES
# =============================================================================

# utility
brew "jupyter"    # jupyter notebook
brew "virtualenv" # virtual environments
brew "rich"       # console output formatter

# code quality
brew "black"  # code formatter
brew "isort"  # import sorter
brew "pylint" # code linter
brew "flake8" # code linter

# data science
brew "numpy"      # numerical computing
brew "scipy"      # scientific computing
brew "sympy"      # symbolic mathematics
brew "pandas"     # data analysis
brew "matplotlib" # data visualization
