# BREW PACKAGES
# =============================================================================

# shell
brew "zsh"                     # brew managed zsh
brew "zsh-completions"         # extra completions
brew "zsh-autosuggestions"     # auto suggestions
brew "zsh-syntax-highlighting" # syntax highlighting
brew "pure"                    # pure shell prompt

# general
brew "git"    # global git
brew "python" # global python
brew "pipx"   # python applications manager
brew "pyenv"  # python version manager
brew "go"     # global go
brew "gh"     # github cli
brew "exa"    # ls replacement
brew "bat"    # cat replacement
brew "mas"    # mac app store cli
brew "btop"   # resource monitor
brew "tmux"   # terminal multiplexer
brew "tpm"    # tmux plugin manager

# vim
brew "neovim"  # vim editor
brew "lazygit" # git ui
brew "ripgrep" # grep replacement
brew "fd"      # find replacement

# docker
brew "colima"         # container runtimes
brew "docker"         # containerization
brew "docker-compose" # container orchestration

# BREW CASKS
# =============================================================================

# general
cask "dotnet-sdk"         # .net sdk
cask "iterm2"             # terminal
cask "raycast"            # spotlight replacement
cask "visual-studio-code" # code editor
cask "godot-mono"         # game engine
cask "mactex-no-gui"      # latex
# cask "zed"                # text editor
# cask "anytype"            # note-taking app

# utilities
cask "iina"           # video player
cask "openinterminal" # open terminal in current directory
cask "sf-symbols"     # system font symbols
cask "the-unarchiver" # unzip files
cask "mouse-fix"      # mouse utility
cask "monitorcontrol" # exteral monitor utility

# MAC APP STORE
# =============================================================================

# apple
mas "Keynote", id: 409183694 # presentation software
mas "Numbers", id: 409203825 # spreadsheet software
mas "Pages", id: 409201541   # word processor software
mas "Xcode", id: 497799835   # xcode

# productivity
mas "Craft", id: 1487937127      # note-taking app
mas "Copilot", id: 1447330651    # finances app
mas "Fantastical", id: 975937182 # calendar app
# mas "TechniCalc", id: 1504965415 # scientifc calculator

# utilities
mas "Tailscale", id: 1475387142 # vpn
mas "Magnet", id: 441258766     # window manager
mas "Noir", id: 1592917505      # safari dark mode
mas "AdGuard", id: 1440147259   # safari ad-blocker
mas "Peek", id: 1554235898      # quicklook plugin
# mas "iPreview", id: 1519213509  # zip quicklook plugin

# FONTS
# =============================================================================

cask "font-computer-modern"          # latex
cask "font-jetbrains-mono-nerd-font" # code
