# CASKS
# =============================================================================

# general
cask "iterm2"             # terminal
cask "raycast"            # spotlight replacement
cask "visual-studio-code" # code editor
# cask "zed"                # text editor

# utilities
cask "mactex-no-gui"  # latex
cask "iina"           # video player
cask "openinterminal" # open terminal in current directory
cask "sf-symbols"     # system font symbols
cask "the-unarchiver" # unzip files
cask "mos"            # mouse scroll smoothing (65, 1, 2.5)
cask "mac-mouse-fix"  # mouse gestures
cask "swish"          # trackpad gestures
cask "monitorcontrol" # exteral monitor utility
cask "applite"        # casks manager

# MAC APP STORE
# =============================================================================

# apple
mas "Keynote", id: 409183694      # presentation software
mas "Numbers", id: 409203825      # spreadsheet software
mas "Pages", id: 409201541        # word processor software
mas "Xcode", id: 497799835        # xcode
mas "GarageBand", id: 682658836   # audio production software
mas "iMovie", id: 408981434       # video editing software
mas "Playgrounds", id: 1496833156 # swift playgrounds

# productivity
mas "Craft", id: 1487937127      # note-taking app
mas "Copilot", id: 1447330651    # finances app
mas "Fantastical", id: 975937182 # calendar app
# mas "TechniCalc", id: 1504965415 # scientifc calculator

# utilities
mas "Tailscale", id: 1475387142 # vpn
mas "Noir", id: 1592917505      # safari dark mode
mas "AdGuard", id: 1440147259   # safari ad-blocker
mas "Peek", id: 1554235898      # quicklook plugin
# mas "iPreview", id: 1519213509  # zip quicklook plugin
